Revit 2027 API
ParameterTypeId.RebarInstanceBarDiameter Property
 "Bar Diameter"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarInstanceBarDiameter { get; }
Public Shared ReadOnly Property RebarInstanceBarDiameter As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarInstanceBarDiameter {
	ForgeTypeId^ get ();
}
static member RebarInstanceBarDiameter : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace